
# CLI Tools
brew "chezmoi"
brew "fd"
brew "fish"
brew "fisher"
brew "lazygit"
brew "ripgrep"
brew "protonpass/tap/pass-cli"
brew "podman"
brew "podman-compose"
brew "uv"
brew "neovim"
brew "git-delta"
brew "direnv"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "imagemagick"
brew "tmux"
brew "gh"
brew "anomalyco/tap/opencode"

# Casks
cask "font-jetbrains-mono-nerd-font" 
cask "ghostty"
cask "proton-pass"
cask "claude-code@latest"
cask "podman-desktop"
cask "vscodium"
cask "zed"
