
# CLI Tools
brew "chezmoi"       # Manage your dotfiles across multiple diverse machines, securely
brew "fd"            # Simple, fast and user-friendly alternative to find
brew "fish"          # User-friendly command-line shell for UNIX-like operating systems
brew "lazygit"       # Simple terminal UI for git commands
brew "ripgrep"       # Search tool like grep and The Silver Searcher
brew "protonpass/tap/pass-cli"
# Editors
brew "neovim"        # Ambitious Vim-fork focused on extensibility and agility
brew "git-delta"
brew "direnv"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "imagemagick"

# Development
# brew "node"          # Open-source, cross-platform JavaScript runtime environment
brew "uv"            # Extremely fast Python package installer and resolver, written in Rust

# Casks (GUI Applications)
cask "font-jetbrains-mono-nerd-font"  # Nerd Font patched JetBrains Mono
cask "ghostty"                        # Terminal emulator that uses platform-native UI and GPU acceleration
cask "proton-pass"
cask "claude-code"
cask "gitbutler"